export default function HomeTab() {
  return (
    <div
      style={{
        direction: "rtl",
        textAlign: "right",
        marginRight: 20,
        marginLeft: 50,
      }}
    >
      <h1 id="welcome-to-hebrew-week">ברוכים הבאים לשבוע העברית!</h1>
      <hr />
      <h2 id="what-is-hebrew-week-">מהו שבוע העברית?</h2>
      <p>
        שבוע העברית הוא חגיגה של השפה העברית. בימינו בכלל ובתחומי המחשוב בפרט,
        השפה העברית חווה השפעות חזקות משפות לועזיות, בראשן האנגלית. כמובן
        שהעברית הושפעה משפות לועזיות מימים ימימה, בראשית משפות כנעניות קרובות,
        ואחר כך משפות כובשינו - בבלית, פרסית, יוונית וכן מהשפות בגלות. דרך
        העברית היא לשאול מילים זרות לשורשים עבריים, ואז להטות אותם על דרך
        העברית. ככה למשל קיבלנו את 'קוד' מ-code, שהביא לנו קידוד וקודן. מילים
        אשר לא לא מתאקלמות לשפה העברית לא יכולות לקחת חלק בתחביר הרגיל, וכך
        לדוגמה נקבל את "עשה push" במקום "דחף".
      </p>
      <p>
        במהלך שבוע העברית אנחנו ננסה להשתמש בעושר הלשוני הקיים והלא־קיים־כרגע של
        העברית כדי לטהר את שפתינו מהשפעות זרות ככל שניתן.
      </p>
      הוגה השבוע הזה לא מתכחש ליעילות של השאלות זרות, ולא מצפה שבסוף השבוע נתנזר
      לעד מן השפה האנגלית, אך כפי שאמר איש חכם - כל המלמד חלופה עברית אחת כאילו
      הציל מילון ומלואו. <p></p>
      <h2 id="what-is-this-website-">מהו האתר הזה?</h2>
      <p>
        זה אמור להיות אתר המרכז את כל המידע השייך לשבוע העברית. פה תוכלו לראות
        את רשימת המשתתפים ומצבם במשחק, ותמצאו מקורות מידע בנוגע לחלופות עבריות,
        חלקן מן האקדמיה וחלקן ממשתתפי שבוע העברית עצמם.
      </p>
      <h2 id="rules-of-the-game">כללי המשחק</h2>
      <ul>
        <li>
          ביטחון המדינה קודם לשפה העברית
          <ul>
            <li>מקרה פרטי - תמשיכו לקודד באנגלית</li>
          </ul>
        </li>
        <li>
          כל אדם רשאי לבחור מראש מתי הוא משתתף במשחק
          <ul>
            <li>ברירת המחדל: בעת העבודה בכותלי המשרד</li>
            <li>רק בשיח עם אנשים לבחירתכם</li>
            <li>רק בשיח, או רק בכתיבה</li>
            <li>וכו'</li>
          </ul>
        </li>
        <li>
          מטרת המשחק - להימנע ממילים ממקורות זרים. יש כמה מקרים פטורים:{" "}
          <ul>
            <li>
              מילים מארמית. שתי השפות הן אחיות קרובות שהתפתחו אחת עם השנייה, לכן
              צפרא טבא מקבל פטור
            </li>
            <li>
              מילים שנשאלו לפני זמן רב. כל דבר מתקופת חז"ל ואחורה כשר, אחר כך
              אפשר להתפלפל
            </li>
            <li>
              מילים שאומצו רשמית על ידי האקדמיה ללשון העברית. מילים כאלה הן על
              תקן מתגיירות ולכן כשרות למטרותינו
            </li>
            <li>שמות</li>
          </ul>
        </li>
        <li>
          על שמות אפשר להתווכח. כמה כללי אצבע:
          <ul>
            <li>
              אם השם הוא בעל משמעות ומתאר מילולית את פעילות מושא השם, העדיפו
              לתרגם אותו. לדוגמה, במקום File Explorer אמרו סייר הקבצים
            </li>
            <li>במקרים אחרים, התרגום הוא לשיקול הדובר</li>
            <li>בכל אופן, תרגום שמות הוא בגדר רשות </li>
          </ul>
        </li>
        <li>ניתן לעבור על החוקים באישור רע"ן ומעלה</li>
      </ul>
      <h2 id="useful-resources">מקורות מידע</h2>
      <p>
        אחד מתפקידי האקדמיה הוא לקבוע מילים חדשות לשפה העברית. כחלק מהתהליך,
        האקדמיה מקימה ועדות שיושבות עם אנשי מקצוע ומפיצה מילונים לתחומי עניין
        ספציפיים. נבצר ממני מלבדל פנימה את המילונים בשל ריבוי תוכן דינאמי בהם,
        אך מומלץ לחפש במרשתת "מילון מונחי האקדמיה" ולעיין בפרט במילון תכנות
        מחשבים משנת תשנ"ט ובמילון שפות תכנות משנת תשע"ה{" "}
      </p>
    </div>
  );
}
